In [38]:
import pandas as pd
import numpy as np

In [2]:
pwd

'/home/aman/Desktop/Data Science course/03-Pandas/my_work'

In [3]:
ls

00-Series.ipynb                 07-Text-Methods.ipynb
01-Dataframes.ipynb             08-Time-Methods.ipynb
02-Conditional_Filtering.ipynb  09-Inputs-and-Outputs.ipynb
03-Useful-Methods.ipynb         example.xlsx
04-Missing-Data.ipynb           newfile.csv
05-Groupby-Operations.ipynb     sample_table.html
06-Combining-DataFrames.ipynb

In [4]:
import os

In [5]:
os.getcwd()

'/home/aman/Desktop/Data Science course/03-Pandas/my_work'

In [6]:
df = pd.read_csv("/home/aman/Desktop/Data Science course/03-Pandas/example.csv")

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df.to_csv('newfile.csv',index=False)

In [9]:
new = pd.read_csv('newfile.csv')

In [10]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
import pandas as pd

In [12]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [13]:
tables = pd.read_html(url)

In [14]:
len(tables)

26

In [15]:
tables[0]

,#,Most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [16]:
world_topten = tables[0]

In [17]:
world_topten = world_topten.drop(11,axis=0)

In [18]:
world_topten = world_topten.drop('#',axis=1)

In [19]:
world_topten.columns = ['Country','2000','2015','2030 Est.']

In [20]:
world_topten

          Country  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [21]:
tables[5].set_index('Rank')

          Country  Population  Area(km2)  Density(pop/km2)
Rank
1       Singapore     5704000        710              8033
2      Bangladesh   172690000     143998              1199
3       Palestine     5266785       6020               847
4         Lebanon     6856000      10452               656
5          Taiwan    23604000      36193               652
6     South Korea    51781000      99538               520
7          Rwanda    12374000      26338               470
8           Haiti    11578000      27065               428
9     Netherlands    17720000      41526               427
10         Israel     9510000      22072               431

In [22]:
world_topten.to_html('sample_table.html',index=False)

In [23]:
# Excel Files

In [24]:
df = pd.read_excel('/home/aman/Desktop/Data Science course/03-Pandas/my_excel_file.xlsx',sheet_name='First_Sheet')

In [25]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
wb = pd.ExcelFile('/home/aman/Desktop/Data Science course/03-Pandas/my_excel_file.xlsx')

In [27]:
wb.sheet_names

['First_Sheet']

In [28]:
excel_sheet_dict = pd.read_excel('/home/aman/Desktop/Data Science course/03-Pandas/my_excel_file.xlsx',sheet_name=None)

In [29]:
type(excel_sheet_dict)

dict

In [30]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [31]:
our_df = excel_sheet_dict['First_Sheet']

In [32]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [33]:
our_df.to_excel('example.xlsx',sheet_name='First_Sheet',index=False)

In [34]:
# SQL Databases

In [36]:
from sqlalchemy import create_engine

In [37]:
temp_db = create_engine('sqlite:///:memory:')

In [40]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [41]:
df

    a   b   c   d
0  20  26  15  67
1  81  57  76  91
2  73  92  50  70
3  28  66  96  80

In [42]:
df.to_sql(name='new_table',con=temp_db)

In [44]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [45]:
new_df

   index   a   b   c   d
0      0  20  26  15  67
1      1  81  57  76  91
2      2  73  92  50  70
3      3  28  66  96  80

In [46]:
result = pd.read_sql_query(sql="SELECT a,c FROM new_table",con=temp_db)

In [47]:
result

    a   c
0  20  15
1  81  76
2  73  50
3  28  96